server/src/load.test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 1000
      rampTo: 10000
  processor: './loadTest.js'
scenarios:
  - flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'test@example.com'
            password: 'password123'
          capture:
            json: '$.token'
            as: 'token'
      - get:
          url: '/api/accounts'
          headers:
            Authorization: 'Bearer {{ token }}'