server/src/load.test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
  processor: './script/loadTest.js'

scenarios:
  - name: Register + Login + Get Accounts
    beforeScenario: generateRandomData
    flow:
      - post:
          url: '/api/auth/register'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
            role: 'Viewer'
      - post:
          url: '/api/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            json: '$.accessToken'
            as: 'token'
      - get:
          url: '/api/accounts'
          headers:
            Authorization: 'Bearer {{ token }}'